{
  "name": "Davi W. M. Suga",
  "subtitle": "Software Engineer",
  "email": "daviciencia1@gmail.com",
  "github": "github.com/davisuga",
  "linkedin": "linkedin.com/in/davisuga/",
  "bio": "Self-taught by nature and programmer since the age of 13, since then in passionate love with the area. Functional programming passionate. In addition to professional experiences, a significant part of what I know was motivated by sheer curiosity and a willingness to experiment and be better.",
  "workExperiences": [
    {
      "title": "Senior Full Stack Developer",
      "place": "Crib Equity",
      "startDate": "02/2023",
      "endDate": "Present",
      "placeDescription": "",
      "achievements": [
        "Developed a real estate platform using Next.js, Tailwind CSS, and TypeScript, increasing lead generation and improving user experience",
        "Implemented functionality for capturing home buyer and agent leads, enhancing lead acquisition and management for the platform.",
        "Created an intuitive and visually appealing homepage, optimizing user engagement and retention.",
        "Ensured application quality and reliability through comprehensive Cypress testing, covering all major features and functionality"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Software Developer",
      "place": "Float Capital",
      "startDate": "01/2023",
      "endDate": "03/2023",
      "placeDescription": "Float Capital is a DeFi protocol",
      "achievements": [
        "Implemented and deployed end-to-end data validation service, incrementing confidence in the backend-generated data",
        "Built full-stack leaderboard feature implementation in ReScript",
        "Promoted testing culture by explaining how and what to test, increasing overall confidence in code",
        "Incremented software resilience by implementing environment validation across multiple services"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Full-stack Developer",
      "place": "EkonoMe",
      "startDate": "08/2020",
      "endDate": "Present",
      "placeDescription": "EkonoMe is an online marketplace for economist's services via videoconferences.",
      "achievements": [
        "Planned the entire implementation based on client needs",
        "Developed a user-facing mobile app with appointments, chat, and video conferencing",
        "Integrated mobile and web clients to let users directly connect to economists for video conferencing",
        "Implemented full-featured Chat with media uploads on both mobile and web app",
        "Built a real-time user management panel using React and Realtime Database"
      ],
      "tags": ["frontend", "mobile", "backend"]
    },
    {
      "title": "Frontend Developer",
      "place": "Harmonize (via Holonic)",
      "startDate": "01/2022",
      "endDate": "11/2022",
      "placeDescription": "Harmonize Health is a remote health management platform that helps providers engage patients easily and reduces the total cost of care.",
      "achievements": [
        "Built entire frontend features from Figma Designs like a real-time messaging center, user management system, and dynamic forms",
        "Worked together with the product and design team to improve the UX of existing features",
        "Proactively took backend responsibilities and delivered authorization features in a Nest+Node.js app"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Software Engineer",
      "place": "Sambatech",
      "startDate": "08/2021",
      "endDate": "01/2022",
      "placeDescription": "SambaTech creates LMS (Learning Management System) and OTT (Over The Top) platforms for companies.",
      "achievements": [
        "Built educational mobile apps from scratch for different companies.",
        "Made various features including SSO auth, concurrent video downloading, offline-first video viewing using Redux Toolkit and Expo"
      ],
      "tags": ["frontend", "mobile"]
    },
    {
      "title": "Mobile/Frontend Developer",
      "place": "Adorie",
      "startDate": "03/2021",
      "endDate": "08/2021",
      "placeDescription": "Adorie was e-commerce focused on local stores and delivery within 2 hours.",
      "achievements": [
        "Improved overall UX by adapting layout for a variety of devices and increasing performance",
        "Developed new features, such as geolocation of products and stores, dynamic filters, persistent cache, etc, using React Native.",
        "Ported the whole e-commerce mobile app code to the web"
      ],
      "tags": ["frontend", "mobile"]
    },
    {
      "title": "Software Developer",
      "place": "Alpha Lumen Institute",
      "startDate": "10/2019",
      "endDate": "03/2021",
      "placeDescription": "The Alpha Lumen Institute is an NGO that seeks solutions with social impact through educational actions, developing numerous action and inspiration projects with the community. Among them, the \"Compartilhe\" app allows you to share offers from humanitarian resources such as food and courses.",
      "achievements": [
        "Planned implementation and built an app called \"Compartilhe\", using Parse in the backend and React Native.",
        "Built state management with concepts of immutability, single source of truth, and reactive programming with React and Redux.",
        "Worked on a learning platform called \"Alpha EdTech\" using React, responsive CSS, Context API, JWT, and a custom design system."
      ],
      "tags": ["frontend", "mobile", "backend"]
    },
    {
      "title": "Open Source Developer",
      "place": "",
      "startDate": "10/2018",
      "endDate": "Present",
      "placeDescription": "",
      "achievements": [
        "<a href=\"https://github.com/0xffea/ocaml-redis/pull/88\">Added support for custom commands</a> on ocaml-redis",
        "Updated ReScript version and added support for ScrollView features on <a href=\"https://github.com/reck753/rescript-reanimated\">rescript-reanimated</a>",
        "<a href=\"https://github.com/davisuga/fast_nbconvert\">Jupyter Notebook → Python converter</a> built in OCaml, also <a href=\"https://pypi.org/project/fast-nbconvert/\">available on pip</a>"
      ],
      "tags": ["frontend", "mobile"]
    }
  ],
  "academicExperiences": [
    {
      "title": "Technical Degree",
      "place": "Federal Institute of Education, Science and Technology of São Paulo - IFSP",
      "startDate": "01/2017",
      "endDate": "01/2021",
      "achievements": [
        "Made undergraduate research and developed a CLI app that creates interactive graphics using solar flare data from NASA's website: github.com/davisuga/solarwheather",
        "Final paper: A programming learning platform named Olá Mundo! <a href=\"github.com/davisuga/olamundo-next\">github.com/davisuga/olamundo-next</a> from scratch using React + NextJS + ChakraUI for frontend and Prisma + PostgreSQL for backend",
        "Implemented Incremental Static Generation for platform content and exercises using markdown"
      ]
    }
  ]
}
