{
  "name": "Davi W. M. Suga",
  "subtitle": "Senior Software Engineer",
  "email": "daviciencia1@gmail.com",
  "github": "github.com/davisuga",
  "linkedin": "linkedin.com/in/davisuga/",
  "bio": "A highly skilled and self-taught software engineer with a passion for functional programming, Davi has been programming since the age of 13. His expertise has been honed by professional experiences and an innate curiosity, as well as a drive to experiment and continuously improve.",
  "workExperiences": [
    {
      "title": "Senior Full Stack Developer",
      "place": "Crib Equity",
      "startDate": "02/2023",
      "endDate": "Present",
      "placeDescription": "",
      "achievements": [
        "Architected and developed a cutting-edge real estate platform using Next.js, Tailwind CSS, and TypeScript, resulting in increased lead generation and enhanced user experience",
        "Implemented advanced functionality for capturing home buyer and agent leads, streamlining lead acquisition and management for the platform",
        "Created an intuitive and visually engaging homepage to optimize user engagement and retention",
        "Ensured application quality and reliability through rigorous Cypress testing, covering all major features and functionality"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Software Developer",
      "place": "Float Capital",
      "startDate": "01/2023",
      "endDate": "03/2023",
      "placeDescription": "Float Capital is a DeFi protocol",
      "achievements": [
        "Implemented and deployed a comprehensive end-to-end data validation service, boosting confidence in the backend-generated data",
        "Built a full-stack leaderboard feature using ReScript, enhancing platform competitiveness",
        "Promoted a testing culture by providing guidance on testing methodologies, resulting in increased overall confidence in code",
        "Enhanced software resilience by implementing environment validation across multiple services"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Co-founder and CTO",
      "place": "EkonoMe",
      "startDate": "08/2020",
      "endDate": "Present",
      "placeDescription": "EkonoMe is an online marketplace for economist's services via videoconferences.",
      "achievements": [
        "Designed and executed a client-centric implementation strategy, setting the foundation for EkonoMe's platform development",
        "Spearheaded the development of EkonoMe's flagship mobile app, enhancing user engagement with integrated scheduling, chat, and video features.        ",
        "Achieved seamless cross-platform video conferencing by integrating mobile and web clients, enhancing user-economist interactions",
        "Revolutionized EkonoMe's chat system by introducing media upload capabilities, enriching user communication on both mobile and web.",
        "Pioneered a real-time user management panel using cutting-edge technologies, streamlining platform oversight and efficiency"
      ],
      "tags": ["frontend", "mobile", "backend"]
    },
    {
      "title": "Frontend Developer",
      "place": "Harmonize (via Holonic)",
      "startDate": "01/2022",
      "endDate": "11/2022",
      "placeDescription": "Harmonize Health is a remote health management platform that helps providers engage patients easily and reduces the total cost of care.",
      "achievements": [
        "Built a range of frontend features from Figma designs, including a real-time messaging center, user management system, and dynamic forms",
        "Collaborated closely with the product and design team to refine the UX of existing features",
        "Proactively assumed backend responsibilities and delivered authorization features in a Nest+Node.js app"
      ],
      "tags": ["frontend", "backend"]
    },
    {
      "title": "Software Engineer",
      "place": "Sambatech",
      "startDate": "08/2021",
      "endDate": "01/2022",
      "placeDescription": "SambaTech creates LMS (Learning Management System) and OTT (Over The Top) platforms for companies.",
      "achievements": [
        "Developed customized educational mobile apps from scratch for various companies",
        "Implemented a wide array of features, including SSO authentication, concurrent video downloading, and offline-first video viewing using Redux Toolkit and Expo"
      ],
      "tags": ["frontend", "mobile"]
    },
    {
      "title": "Mobile/Frontend Developer",
      "place": "Adorie",
      "startDate": "03/2021",
      "endDate": "08/2021",
      "placeDescription": "Adorie was an e-commerce platform focused on local stores and delivery within 2 hours.",
      "achievements": [
        "Enhanced overall UX by optimizing layouts for various devices and improving performance",
        "Developed innovative features, such as geolocation of products and stores, dynamic filters, and persistent cache using React Native",
        "Seamlessly ported the entire e-commerce mobile app code to the web"
      ],
      "tags": ["frontend", "mobile"]
    },
    {
      "title": "Software Developer",
      "place": "Alpha Lumen Institute",
      "startDate": "10/2019",
      "endDate": "03/2021",
      "placeDescription": "The Alpha Lumen Institute is an NGO that seeks solutions with social impact through educational actions, developing numerous action and inspiration projects with the community. Among them, the \"Compartilhe\" app allows you to share offers from humanitarian resources such as food and courses.",
      "achievements": [
        "Conceptualized and developed the \"Compartilhe\" app using Parse in the backend and React Native",
        "Implemented state management with a focus on immutability, single source of truth, and reactive programming using React and Redux",
        "Contributed to the development of the \"Alpha EdTech\" learning platform using React, responsive CSS, Context API, JWT, and a custom design system"
      ],
      "tags": ["frontend", "mobile", "backend"]
    },
    {
      "title": "Open Source Developer",
      "place": "",
      "startDate": "10/2018",
      "endDate": "Present",
      "placeDescription": "",
      "achievements": [
        "<a href=\"https://github.com/0xffea/ocaml-redis/pull/88\">Added support for custom commands</a> on ocaml-redis",
        "Updated ReScript version and added support for ScrollView features on <a href=\"https://github.com/reck753/rescript-reanimated\">rescript-reanimated</a>",
        "<a href=\"https://github.com/davisuga/fast_nbconvert\">Jupyter Notebook → Python converter</a> built in OCaml, also <a href=\"https://pypi.org/project/fast-nbconvert/\">available on pip</a>"
      ],
      "tags": ["frontend", "mobile"]
    }
  ],
  "academicExperiences": [
    {
      "title": "Technical Degree",
      "place": "Federal Institute of Education, Science and Technology of São Paulo - IFSP",
      "startDate": "01/2017",
      "endDate": "01/2021",
      "achievements": [
        "Conducted undergraduate research and developed a CLI app that creates interactive graphics using solar flare data from NASA's website: github.com/davisuga/solarwheather",
        "Final paper: Developed a programming learning platform named Olá Mundo! <a href=\"github.com/davisuga/olamundo-next\">github.com/davisuga/olamundo-next</a> from scratch using React + NextJS + ChakraUI for frontend and Prisma + PostgreSQL for backend",
        "Implemented Incremental Static Generation for platform content and exercises using markdown"
      ]
    }
  ]
}
